ЧартерEDT.Расширение1/src/InformationRegisters/чартер_КвотированиеОрганизацийНаРейс/чартер_КвотированиеОрганизацийНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>чартер_КвотированиеОрганизацийНаРейс</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Квота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.чартер_Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКомпановки</name>
    <type>
      <types>EnumRef.чартер_ТипВСРассадка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЧартерEDT.Расширение1/src/InformationRegisters/чартер_КвотированиеОрганизацийНаРейс/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
 
// Получить квоты за период.
// 
// Параметры:
//  Параметры - Структура
// 
// Возвращаемое значение:
//  Неопределено, ВыборкаИзРезультатаЗапроса - Получить квоты за период
Функция ПолучитьКвотыЗаПериод(Параметры) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	чартер_КвотированиеОрганизацийНаРейсСрезПоследних.Организация КАК Организация,
					|	чартер_КвотированиеОрганизацийНаРейсСрезПоследних.Квота КАК КвотаНаРейс
					|ИЗ
					|	РегистрСведений.чартер_КвотированиеОрганизацийНаРейс.СрезПоследних(&ДатаРейса, ТипКомпановки = &ТипКомпановки) КАК
					|		чартер_КвотированиеОрганизацийНаРейсСрезПоследних";   
				
	Запрос.УстановитьПараметр("ДатаРейса", НачалоМесяца(Параметры.ДатаРейса));
	Запрос.УстановитьПараметр("ТипКомпановки", Параметры.ТипВС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		Результат = РезультатЗапроса;		 	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
